CFDEM/CFDEMcoupling/tutorials/cfdemSolverCatalyticReactingRhoPimple/packedBedAdiabatic-PA-ISAT/CFD/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

libs            ("libcatchyFiniteVolume.so");

application     cfdemSolverCatalyticReactingRhoPimple;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         0.10;

deltaT          5e-8;

writeControl    adjustableRunTime;

writeInterval   0.01;

purgeWrite      0;

writeFormat     ascii;

writePrecision  15;

writeCompression uncompressed;

timeFormat      general;

timePrecision   7;

runTimeModifiable yes;

functions
{
    #includeFunc    "outletAverage"
}

OptimisationSwitches 
{
    fileHandler uncollated;
}

// ************************************************************************* //
